webservice-demo/src/main/resources/notCustomParam.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <notCustomParam xmlns="http://qxm.com/">
            <arg0>para1</arg0>
            <arg1>para2</arg1>
            <arg2>para3</arg2>
        </notCustomParam>
    </soap:Body>
</soap:Envelope>